/*******************************************************************************

* º¯Êı¹¦ÄÜÃû:   ÎÂ¶ÈÏÔÊ¾

*******************************************************************************/

#include"lcd.h"
#include"temp.h"
#include"lcd1602.h"
uchar danwei[] = "T:";
void DisDate();
void LcdDisplay(int);
void DisTime();
void DisTemperture();
void DisDate();
/*******************************************************************************
* º¯ÊıÃû         : Distemperture()
* º¯Êı¹¦ÄÜ		 : ÏÔÊ¾ÎÂ¶È
*******************************************************************************/

void DisTemperture()
{

//	LcdInit();			 //³õÊ¼»¯LCD1602
//	LCD1602_Initialize();
    LCD1602_PrintString(2,1,danwei);
	LcdWriteCom(0xC5);	//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('C');
//	DisTime();					  //ÏÔÊ¾Ê±¼ä
		    
//	DisClock();					  //ÏÔÊ¾ÄÖÖÓĞòºÅ
    
//	DisDate();					  //ÏÔÊ¾ÈÕÆÚ 
	
//	while(1)
//	{

		LcdDisplay(Ds18b20ReadTemp());
		
        
//	}
}

/*******************************************************************************
* º¯ÊıÃû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		 : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
    
  	unsigned char  datas[] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
	  	LcdWriteCom(0xC2);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
		SBUF='-';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
	    LcdWriteData('-');  		//ÏÔÊ¾¸º
		//ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		temp=temp-1;
		temp=~temp;
		tp=temp;
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
 
  	}
 	else						 //µ±ÎÂ¶ÈÖµÎªÕıÊı
  	{			
	  	LcdWriteCom(0xC2);		//Ğ´µØÖ· C0±íÊ¾³õÊ¼µØÖ·
	    LcdWriteData('+'); 		//ÏÔÊ¾Õı
		SBUF='+';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
//	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
//	datas[3] = temp % 100 / 10;
//	datas[4] = temp % 10;

/*	LcdWriteCom(0xC1);		  //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[0]); //°ÙÎ» 
	SBUF = '0'+datas[0];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;	*/
	
	LcdWriteCom(0xC3);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[1]); //Ê®Î»
	SBUF = '0'+datas[1];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0xC4);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[2]); //¸öÎ» 
	SBUF = '0'+datas[2];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

/*	LcdWriteCom(0xC3);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('.'); 		//ÏÔÊ¾ ¡®.¡¯
	SBUF = '.';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;	 */

/*	LcdWriteCom(0xC3);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[3]); //ÏÔÊ¾Ğ¡Êıµã  
	SBUF = '0'+datas[3];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0xC4);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[4]); //ÏÔÊ¾Ğ¡Êıµã 
	SBUF = '0'+datas[4];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;*/
/*	for(i=0; i<6; i++)
	{
	 	SBUF = CNCHAR[i];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI = 0;
	} */

	 
}



